In [3]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [4]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],'k2':['alpha','beta','alpha','beta','alpha'],
'dataset1': np.random.randn(5),'dataset2': np.random.randn(5)})

In [6]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.004801 -0.042619
1  X   beta  1.009702 -0.996722
2  Y  alpha -0.475698 -0.101791
3  Y   beta  1.513881  0.260014
4  Z  alpha -0.114094  1.037714

In [9]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [10]:
group1

In [11]:
group1.mean()

k1
X    0.502451
Y    0.519091
Z   -0.114094
Name: dataset1, dtype: float64

In [12]:
cities = np.array(['NY','LA','LA',"NY",'NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [1]:
dataset1

NameError: name 'dataset1' is not defined

In [14]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    1.009702
    JAN   -0.475698
NY  FEB    1.513881
    JAN   -0.059448
Name: dataset1, dtype: float64

In [15]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.004801 -0.042619
1  X   beta  1.009702 -0.996722
2  Y  alpha -0.475698 -0.101791
3  Y   beta  1.513881  0.260014
4  Z  alpha -0.114094  1.037714

In [16]:
dframe.groupby('k1').mean()

C:\Users\sanja\AppData\Local\Temp\ipykernel_10400\1903047256.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.502451 -0.519671
Y   0.519091  0.079111
Z  -0.114094  1.037714

In [17]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.004801 -0.042619
   beta   1.009702 -0.996722
Y  alpha -0.475698 -0.101791
   beta   1.513881  0.260014
Z  alpha -0.114094  1.037714

In [18]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [20]:
for name, group in dframe.groupby('k1'):
    print("this is the %s group" %name)
    print(group)
    print('\n')

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.004801 -0.042619
1  X   beta  1.009702 -0.996722


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.475698 -0.101791
3  Y   beta  1.513881  0.260014


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.114094  1.037714